{
    "books": [
         
          {
            "id": 1,
            "imageUrl": "card/card-2.jpg",
            "price": 2599,
            "category": 0,
            "name": "Резиг, Бибо, Марас – Секреты JavaScript ниндзя",
            "discripshion": "Этот труд является переработанным изданием, в котором были внесены дополнительные сведения по следующим темам: функции, замыкания, объекты, прототипы и промисы. Вы изучите: DOM, события и таймеры, передовые практики программирования, тестирование и кросс-браузерный код."
          },
          {
            "id": 2,
            "imageUrl": "card/card-3.jpg",
            "price": 999,
            "category": 0,
            "name": "Э. Браун – Изучаем JavaScript. Руководство по созданию современных веб-сайтов",
            "discripshion": "Это издание познакомит вас с правилами, спецификациями и инструментальными методами, используемыми в ES6, опираясь на практическую основу, а также научит создавать эффективные приложения на клиентской стороне и в Node.js. Вот неполный список того, с чем вам придётся иметь дело в процессе обучения."
          },
          {
            "id": 6,
            "imageUrl": "card/card-10.jpg",
            "price": 2199,
            "category": 3,
            "name": "Прайс. C# 7 и .NET Core. Кросс-платформенная разработка для профессионалов",
            "discripshion": "Книга представляет собой скорее обзор платформы, чем руководство по ней. Поэтому для «глубокого погружения» в .NET Core она, к сожалению, не подойдёт. Но для новичков или программистов, которые уже имеют опыт работы с .NET Framework и желают освоить .NET Core, эта книга идеальный вариант для «быстрого старта»."
          },
          {
            "id": 3,
            "imageUrl": "card/card-4.jpg",
            "price": 1699,
            "category": 0,
            "name": "Н. Закас – JavaScript. Оптимизация производительности",
            "discripshion": "Всем известно (ну, или почти всем) что вся динамика сайта построена на JS. Эта динамика имеет минус – замедление загрузки страницы, важной для маленького отклика ресурса. Книга расскажет о приёмах и секретах, применяемых для устранения слабых мест, несущих просадку производительности. Вы освоите ускорение выполнения загрузки, методы манипулирования с DOM, правильную работу со страницей и массу другой полезной информации."
          },
          {
            "id": 8,
            "imageUrl": "card/card-12.jpg",
            "price": 1799,
            "category": 1,
            "name": "Марк Лутц. Изучаем Python",
            "discripshion": "Классический учебник Python со всесторонним глубоким введением в язык программирования и для новичков в программировнии, и для профи. Основана на популярном учебном курсе Лутца. Учит писать эффективный качественный код."
          },
          {
            "id": 4,
            "imageUrl": "card/card-8.jpg",
            "price": 1599,
            "category": 1,
            "name": "Эрик Мэтиз. Изучаем Python. Программирование игр, визуализация данных, веб-приложения",
            "discripshion": "Руководство по языку Python c многочисленными примерами, которые обучают шаблонам чистого кода. После освоения базы языка обучение продолжается на рабочих проектах с использованием известных библиотек: 1) аркадная игра в стиле Space Invaders (библиотека pygame), 2) интерактивная визуализация данных (библиотеки matplotlib и plotly) и 3) веб-приложение на Django."
          },
          {
            "id": 7,
            "imageUrl": "card/card-11.jpg",
            "price": 1699,
            "category": 4,
            "name": "Эффективная Java – Джошуа Блох",
            "discripshion": "Ничего удивительного, что эффективная Java от Джошуа Блоха – это лучшая книга. Это определенно обязательная к прочтению книга по Java для программистов любого уровня. Вы получите массу информации по ЯП и его API, т. к. автор является создателем нескольких ключевых классов, таких как java.lang и Java Collection framework."
          },
          {
            "id": 5,
            "imageUrl": "card/card-9.png",
            "price": 1499,
            "category": 2,
            "name": "Стивен Прата. Язык программирования C++. Лекции и упражнения",
            "discripshion": "Эта классическая работа по вычислительной технике обучает принципам программирования, среди которых структурированный код и нисходящее проектирование, а также использованию классов, наследования, шаблонов, исключений, лямбда-выражений."
          },
          {
            "id": 11,
            "imageUrl": "card/card-15.jpg",
            "price": 2499,
            "category": 3,
            "name": "Троелсен и Джепикс. Язык программирования C# 7 и платформы .NET и .NET Core",
            "discripshion": "В 8-м издании книги дано описание функциональных возможностей последних версий C# и .NET, а также межплатформенной инфраструктуры Microsoft .NET Core."
          },
          {
            "id": 9,
            "imageUrl": "card/card-13.jpg",
            "price": 1499,
            "category": 1,
            "name": "Даг Хеллман. Стандартная библиотека Python 3. Справочник с примерами",
            "discripshion": "Стандартная библиотека Python содержит сотни модулей, позволяющих взаимодействовать с операционной системой, интерпретатором и Интернетом. В этой книге Даг Хеллман описывает основные разделы библиотеки Python 3.x, сопровождая изложение материала компактными примерами исходного кода и результатами их выполнения. Приведенные примеры наглядно демонстрируют возможности каждого из модулей, предлагаемых библиотекой, и пригодны не только для изучения, но и для использования в реальном коде."
          },
          {
            "id": 0,
            "imageUrl": "card/card-1.jpg",
            "price": 1999,
            "category": 0,
            "name": "М. Фаулер – Рефакторинг кода на JavaScript",
            "discripshion": "Без качественного рефакторинга сложно себе представить работоспособный и растущий проект. В этом труде описано более 50 способов отрефакторить код с практическими примерами. Работы Мартина Фаулера пользуется популярностью и данная книга не исключение."
          },
          {
            "id": 10,
            "imageUrl": "card/card-14.png",
            "price": 2199,
            "category": 2,
            "name": "Роберт C. Мартин. Гибкая разработка программ на Java и C++. Принципы, паттерны и методики",
            "discripshion": "Как и указано на обложке, примеры есть и на C++, и на Java, для лучшего понимания желательно знать оба языка. Рассматриваются ООП, UML, паттерны, приемы гибкого и экстремального программирования, а также приводится детальное описание полного процесса проектирования для многократно используемых программ на C++ и Java."
          }


     
     
    ],
    "cart": [
      
    ]
}